Revit 2026 API

# ElectricalEquipmentSetCircuitNamingSchemeType Method

---

Sets the circuit naming scheme for Electrical Equipment.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCircuitNamingSchemeType(
	CircuitNaming circuitNamingType
)
```
```vb
Public Sub SetCircuitNamingSchemeType (
	circuitNamingType As CircuitNaming
)
```
```cpp
public:
void SetCircuitNamingSchemeType(
	CircuitNaming circuitNamingType
)
```
```fsharp
member SetCircuitNamingSchemeType :
        circuitNamingType : CircuitNaming -> unit
```

#### Parameters

circuitNamingType CircuitNaming
     The enumerated type of circuit naming scheme to be set.

| Exception | Condition |
| --- | --- |
| ArgumentException | The circuit naming scheme enumerated type is invalid for the Electrical Equipment. |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

The following circuit naming scheme type can be set:

  * CircuitNaming::Prefixed
  * CircuitNaming::Standard
  * CircuitNaming::PanelName
  * CircuitNaming::Phase
  * CircuitNaming::ProjectSetting

For a customized circuit naming scheme, set its id directly with _SetCircuitNamingSchemeId_ method.

#### Reference

ElectricalEquipment Class

Autodesk.Revit.DB.Electrical Namespace